import sys

def translitterate(text: str) -> str:
    letters_dict = {
        'а': 'a',
        'б': 'b',
        'в': 'v',
        'г': 'h',
        'ґ': 'g',
        'д': 'd',
        'е': 'e',
        'є': 'ie',
        'ж': 'zh',
        'з': 'z',
        'и': 'y',
        'і': 'i',
        'ї': 'i',
        'й': 'i',
        'к': 'k',
        'л': 'l',
        'м': 'm',
        'н': 'n',
        'о': 'o',
        'п': 'p',
        'р': 'r',
        'с': 's',
        'т': 't',
        'у': 'u',
        'ф': 'f',
        'х': 'kh',
        'ц': 'ts',
        'ч': 'ch',
        'ш': 'sh',
        'щ': 'shch',
        'ь': '',
        'ю': 'iu',
        'я': 'ia',
        'А': 'A',
        'Б': 'B',
        'В': 'V',
        'Г': 'H',
        'Ґ': 'G',
        'Д': 'D',
        'Е': 'E',
        'Є': 'Ye',
        'Ж': 'Zh',
        'З': 'Z',
        'И': 'Y',
        'І': 'I',
        'Ї': 'Yi',
        'Й': 'Y',
        'К': 'K',
        'Л': 'L',
        'М': 'M',
        'Н': 'N',
        'О': 'O',
        'П': 'P',
        'Р': 'R',
        'С': 'S',
        'Т': 'T',
        'У': 'U',
        'Ф': 'F',
        'Х': 'Kh',
        'Ц': 'Ts',
        'Ч': 'Ch',
        'Ш': 'Sh',
        'Щ': 'Shch',
        'Ю': 'Yu',
        'Я': 'Ya'
    }

    trans_dict = str.maketrans(letters_dict)
    new_text = text.translate(trans_dict)
    return new_text


text_text = """
27 січня 2010 р. Кабінет Міністрів України видав постанову, в якій впорядкував правила транслітерації української абетки латиницею, затвердивши таблицю транслітерації.Ці правила застосовують зокрема, видаючи закордонні паспорти громадянам України. Головною особливістю цього стандарту порівняно з історичними латинками є те, що в його основу покладено англійський правопис, а також повністю упущено пом'якшення м'яким знаком. Цей правопис зокрема використали поряд із кирилицею у Львові під час транслітерації назв вулиць, а також у Харкові для транслітерації назв станцій метро. https://uk.wikipedia.org/wiki/Українська_латинка
"""


# print(translitterate(text_text))

print(translitterate(' '.join(sys.argv[1:])))

